app/controllers/api/v1/creators_controller.rb

SELECT "creators".* FROM "creators"
---
    def index
        facade = CreatorFacade.index(Creator.all)

SELECT "creators".* FROM "creators" WHERE "creators"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
---
    def show
        creator = Creator.find(params[:id])

SELECT "creators".* FROM "creators" WHERE "creators"."name" = $1 LIMIT $2  [["name", "TestName123abc"], ["LIMIT", 1]]
INSERT INTO "creators" ("name", "youtube_handle", "twitch_handle", "twitter_handle", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "TestName123abc"], ["youtube_handle", nil], ["twitch_handle", nil], ["twitter_handle", nil], ["created_at", "2024-03-25 02:14:57.898538"], ["updated_at", "2024-03-25 02:14:57.898538"]]
---
    def create
        if Creator.find_by(name: params[:name]) == nil
            creator = Creator.create(creator_params)

SELECT "creators".* FROM "creators" WHERE "creators"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "creators" SET "youtube_handle" = $1, "twitch_handle" = $2, "twitter_handle" = $3, "updated_at" = $4 WHERE "creators"."id" = $5  [["youtube_handle", "UCX6OQ3DkcsbYNE6H8uQQuVA"], ["twitch_handle", "mrbeast6000"], ["twitter_handle", "MrBeast"], ["updated_at", "2024-03-25 21:06:37.285641"], ["id", 20]]
---
    def update
        creator = Creator.find_by(id: params[:id])
        if creator != nil
            if creator.update(creator_params)

SELECT "creators".* FROM "creators" WHERE "creators"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "creators" WHERE "creators"."id" = $1  [["id", 12]]
---
    def destroy
        creator = Creator.find_by(id: params[:id])
        if creator != nil
            if creator.destroy