app/controllers/api/v1/follows_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
    def create
        user = User.find_by(id: params[:user_id])