app/controllers/api/v1/follows_controller.rb

INSERT INTO "follows" ("user_id", "creator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["creator_id", 23], ["created_at", "2024-03-25 21:06:37.301968"], ["updated_at", "2024-03-25 21:06:37.301968"]]
---
    def create
        user = find_user_by_id(params[:user_id])
        creator = find_creator_by_id(params[:creator_id])
        follow = user.follows.new(creator_id: creator.id)

        if follow.save

DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 13]]
---
    def destroy
        user = User.find_by(id: params[:user_id])
        if user != nil
            creator = Creator.find_by(id: params[:id])
            if creator != nil
                follow = user.follows.find_by(creator_id: creator.id)
                if follow != nil
                    if follow.destroy