app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "TestName123abc"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "TestName123abc"], ["email", "test@email.com"], ["created_at", "2024-03-26 13:05:20.881573"], ["updated_at", "2024-03-26 13:05:20.881573"]]
---
    def create
        if params[:name] != nil && params[:name] != ''
            if User.find_by(name: params[:name]) == nil
                user = User.create(user_params)